[
  {
      "bookId": 1,
      "bookName": "Annotated Texas Family Code 2012 ",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/92hRGkH/annotated.png",
      "review": "The Great Gatsby by F. Scott Fitzgerald:  This classic novel explores themes of love, wealth, and the American Dream through the eyes of the enigmatic Jay Gatsby. Set in the Jazz Age, it follows the story of Gatsby's pursuit of the elusive Daisy Buchanan and the tragic consequences that ensue. Fitzgerald's lyrical prose and vivid characterization make this a timeless masterpiece.",
      "totalPages": 281,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["Classic", "Drama", "Social Issues"],
      "publisher": "J. B. Lippincott & Co.",
      "yearOfPublishing": 1960
  },
  {
      "bookId": 2,
      "bookName": "Why do you hate Money ?",
      "author": "George Orwell",
      "image": "https://i.ibb.co/cFCyXWd/mony.png",
      "review": "To Kill a Mockingbird by Harper Lee: Through the innocent perspective of Scout Finch, this Pulitzer Prize-winning novel tackles issues of racism and injustice in the American South. Atticus Finch's defense of a black man falsely accused of rape serves as a poignant commentary on morality and empathy. Lee's storytelling is both poignant and thought-provoking.",
      "totalPages": 328,
      "rating": 4.8,
      "category": "Science Fiction",
      "tags": ["Dystopian", "Political", "Philosophical"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
  },
  {
      "bookId": 3,
      "bookName": "Knevin J. anderoson spine of the dragon",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.ibb.co/g6WSJvQ/kevin.png",
      "review": "1984 by George Orwell: Orwell's dystopian masterpiece paints a chilling picture of a totalitarian regime where individuality is suppressed and truth is manipulated. Winston Smith's rebellion against the oppressive Party and his doomed love affair with Julia captivate readers while warning against the dangers of authoritarianism and surveillance.",
      "totalPages": 180,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["Classic", "Romance", "Tragedy"],
      "publisher": "Charles Scribner's Sons",
      "yearOfPublishing": 1925
  },
  {
      "bookId": 4,
      "bookName": "The lost art of good conversation",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/jrD8smq/ksoe.png",
      "review": "The Catcher in the Rye by J.D. Salinger: Narrated by the disillusioned teenager Holden Caulfield, this coming-of-age novel captures the angst and alienation of adolescence. As Holden navigates through a world he perceives as phony and superficial, readers are compelled to confront questions of identity, belonging, and the loss of innocence.",
      "totalPages": 279,
      "rating": 4.7,
      "category": "Romance",
      "tags": ["Classic", "Satire", "British Literature"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
  },
  {
      "bookId": 5,
      "bookName": "The scholarship monthly planner",
      "author": "J.D. Salinger",
      "image": "https://i.ibb.co/w6NGsvL/scholarship.png",
      "review": "Pride and Prejudice by Jane Austen: Austen's timeless romance follows the spirited Elizabeth Bennet as she navigates the complexities of love and social status in early 19th-century England. Through sharp wit and keen observation, Austen satirizes the society's obsession with marriage and highlights the importance of self-awareness and personal growth.",
      "totalPages": 277,
      "rating": 4.4,
      "category": "Fiction",
      "tags": ["History", "Horor"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
  },
  {

   
      "bookId": 6,
      "bookName": "Cold-Case Fancy English Grammar",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/tJf7dz9/the-hate.png",
      "review": "The Hobbit by J.R.R. Tolkien: This beloved fantasy novel chronicles the adventures of Bilbo Baggins, a reluctant hobbit thrust into a quest to reclaim a stolen treasure guarded by the dragon Smaug. Tolkien's richly imagined world of Middle-earth, filled with dwarves, elves, and wizards, continues to captivate readers of all ages with its timeless themes of courage, friendship, and heroism.",
      "totalPages": 281,
      "rating": 6.8,
      "category": "Fiction",
      "tags": ["Classic", "Drama", "Social Issues"],
      "publisher": "J. B. Lippincott & Co.",
      "yearOfPublishing": 1960
  },
  {
      "bookId": 7,
      "bookName": "The dating playbook for men ",
      "author": "Paulo Coelho",
      "image": "https://i.ibb.co/rbdyrLm/pngwing.png",
      "review": "Tolkien's epic fantasy trilogy follows the journey of Frodo Baggins and his companions as they seek to destroy the One Ring and defeat the dark lord Sauron. Set against the backdrop of an epic struggle between good and evil, the series explores themes of power, sacrifice, and the resilience of the human spirit, leaving a lasting impact on the fantasy genre.",
      "totalPages": 197,
      "rating": 5.6,
      "category": "Fiction",
      "tags": ["Philosophical", "Adventure", "Spirituality"],
      "publisher": "HarperCollins",
      "yearOfPublishing": 1988
  },
  {
      "bookId": 8,
      "bookName": "Loving lesus more",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/WBGQqFD/loving.png",
      "review": "A delightful adventure filled with dwarves, wizards, and dragons.This allegorical novel follows Santiago, a young shepherd boy, on a journey to fulfill his personal legend and discover the true meaning of life. Through encounters with various characters and experiences, Santiago learns valuable lessons about following one's dreams, embracing the unknown, and finding purpose in the journey itself.",
      "totalPages": 310,
      "rating": 5.2,
      "category": "Fantasy",
      "tags": ["Adventure", "Middle-earth", "Quest"],
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1937
  },
  {
      "bookId": 9,
      "bookName": "The Hitchhiker's Guide to the Galaxy",
      "author": "Douglas Adams",
      "image": "https://i.ibb.co/ysg4m86/cold.png",
      "review": "A hilarious and absurd journey through space with an eccentric cast of characters. Set in Afghanistan against the backdrop of political upheaval, Hosseini's novel explores themes of friendship, betrayal, and redemption. Through the complex relationship between Amir and Hassan, childhood friends from different social classes, the story delves into the impact of guilt and the search for atonement in the face of past mistakes.",
      "totalPages": 215,
      "rating": 4.5,
      "category": "Science Fiction",
      "tags": ["Humor", "Space Opera", "Satire"],
      "publisher": "Pan Books",
      "yearOfPublishing": 1979
  }
]
